; domain
(define
	(domain HYRULE)
	(:requirements :adl :typing :universal-preconditions)
	(:types 
		actant portal - entity
		location entity prefab - object
		door entrance - portal
		character item - actant
	)
	(:constants )
	(:predicates
		(at ?x - entity ?y - location)
		(has ?x - character ?y - item)
		(leadsto ?x - entrance ?y - location)
		(connected ?x - location ?y - location)
		(closed ?x - entrance)
		(locked ?x - portal)
		(unlocks ?x - item ?y - portal)
		(doorway ?x - location ?y - location)
		(doorbetween ?x - door ?y - location ?z - location)
		(tutorial-has-been-completed)
		
		(player ?x - character)
		(wants-item ?x - character ?y - item)
		(willing-to-give-item ?x - character ?y - item)
		(prefab ?x - object ?y - prefab)
	)

	(:action talk-to
		:parameters (?speaker - character ?hearer - character ?location - location)
		:precondition
			(and
				(player ?speaker)
				(at ?speaker ?location)
				(at ?hearer ?location)
			)
		:effect
			(and
				(player ?speaker)
				(at ?speaker ?location)
				(at ?hearer ?location)
			)
	)

	(:action look-at
		:parameters (?character - character ?entity - entity ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(at ?entity ?location)
			)
		:effect
			(and
				(player ?character)
				(at ?character ?location)
				(at ?entity ?location)
			)
	)

	(:action open
		:parameters (?character - character ?entrance - entrance ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(at ?entrance ?location)
				(closed ?entrance)
				(not (locked ?entrance))
			)
		:effect
				(not (closed ?entrance))
	)

	(:action close
		:parameters (?character - character ?entrance - entrance ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(at ?entrance ?location)
				(not (closed ?entrance))
				(not (locked ?entrance))
			)
		:effect
				(closed ?entrance)
	)

	(:action pickup
		:parameters (?character - character ?item - item ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(at ?item ?location)
			)
		:effect
			(and
				(not (at ?item ?location))
				(has ?character ?item)
				(willing-to-give-item ?character ?item)
			)
	)

	(:action drop
		:parameters (?character - character ?item - item ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(has ?character ?item)
				(willing-to-give-item ?character ?item)
			)
		:effect
			(and
				(not (has ?character ?item))
				(at ?item ?location)
				(not (willing-to-give-item ?character ?item))
			)
	)

	(:action give
		:parameters (?sender - character ?item - item ?receiver - character ?location - location)
		:precondition
			(and
				(at ?sender ?location)
				(has ?sender ?item)
				(willing-to-give-item ?sender ?item)
				(at ?receiver ?location)
				(not (has ?receiver ?item))
				(wants-item ?receiver ?item)
			)
		:effect
			(and
				(not (has ?sender ?item))
				(not (willing-to-give-item ?sender ?item))
				(not (wants-item ?receiver ?item))
				(has ?receiver ?item)
			)
	)

	(:action move-through-doorway
		:parameters (?character - character ?from - location ?to - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?from)
				(not (at ?character ?to))
				(connected ?from ?to)
				(doorway ?from ?to)
				(not (= ?from ?to))
			)
		:effect
			(and
				(not (at ?character ?from))
				(at ?character ?to)
			)
	)

	(:action move-through-door
		:parameters (?character - character ?from - location ?door - door ?to - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?from)
				(not (at ?character ?to))
				(not (= ?from ?to))
				(connected ?from ?to)
				(doorbetween ?door ?from ?to)
				(not (locked ?door))
			)
		:effect
			(and
				(not (at ?character ?from))
				(at ?character ?to)
			)
	)

	(:action move-through-entrance
		:parameters (?character - character ?from - location ?entrance - entrance ?to - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?from)
				(not (at ?character ?to))
				(not (= ?from ?to))
				(at ?entrance ?from)
				(leadsto ?entrance ?to)
				(not (closed ?entrance))
			)
		:effect
			(and
				(not (at ?character ?from))
				(at ?character ?to)
			)
	)

	(:action unlock-door
		:parameters (?character - character ?key - item ?door - door)
		:precondition
			(and
				(player ?character)
				(locked ?door)
				(has ?character ?key)
				(unlocks ?key ?door)
			)
		:effect
			(and
				(not (locked ?door))
				(not (has ?character ?key))
			)
	)

	(:action unlock-entrance
		:parameters (?character - character ?key - item ?entrance - entrance ?location - location)
		:precondition
			(and
				(player ?character)
				(locked ?entrance)
				(has ?character ?key)
				(unlocks ?key ?entrance)
				(at ?character ?location)
				(at ?entrance ?location)
			)
		:effect
			(and
				(not (locked ?entrance))
				(not (has ?character ?key))
			)
	)

	(:action donothing
		:parameters (?character - character)
		:precondition
			(and
				(player ?character)
			)
		:effect
				(player ?character)
	)

	(:action win-the-game
		:parameters (?character - character)
		:precondition
			(and
				(player ?character)
			)
		:effect
				
	)
)

; problem
(define (problem rob)
(:domain HYRULE)
	(:objects 
		 basemententrance basementexit barentrance barexit hutentrance hutexit forgeentrance forgeexit shopentrance shopexit bankentrance bankexit fortentrance fortexit mansionentrance mansionexit - entrance
		 junkyard docks bar townarch townsquare hut forge shop bank valley fort cliff mansion basement storage - location
		 player wizard orc riddler quartermaster appraiser fortuneteller knight paladin baron baroness governor majordomo blacksmith banker citizenone citizentwo apprentice barkeep sand woods cave town beach junk woodenhouse brickhouse cliffedge woodendoor gate sword shield ring key coins skull candlestick cupcake contract letter tonic flowers lasso openbook pailofwater glassmirror tinymushroom silverbullion cat - prefab
		 arthur mel alli michael ian giovanna james dorian jordan camille phillip avery peter frank roger dave karina matthias oscar - character
		 towngate - door
		 knightsword knightshield rubyring coin humanskull candle lovecontract tastycupcake shinykey loveletter hairtonic bouquet rope book bucket mirror mushroom silver ash basementexitkey basementbucket - item
	)
	(:init
		(at forgeexit forge)
		(at alli junkyard)
		(at arthur bar)
		(at mel bar)
		(at fortexit fort)
		(at fortentrance valley)
		(at mansionexit mansion)
		(at michael hut)
		(at tastycupcake hut)
		(at frank townsquare)
		(at ian fort)
		(at camille fort)
		(at phillip fort)
		(at mansionentrance cliff)
		(at oscar bar)
		(at forgeentrance townarch)
		(at basementexit basement)
		(at barentrance docks)
		(at barexit bar)
		(at basemententrance bar)
		(at hutentrance townarch)
		(at hutexit hut)
		(at shopentrance townsquare)
		(at shopexit shop)
		(at bankentrance townsquare)
		(at bankexit bank)
		(at knightsword forge)
		(at hairtonic hut)
		(at roger mansion)
		(at rope forge)
		(at bucket fort)
		(at mirror junkyard)
		(at book hut)
		(at mushroom docks)
		(at dave townsquare)
		(at karina townarch)
		(at matthias forge)
		(at silver bank)
		(at peter forge)
		(at shinykey bar)
		(at coin bank)
		(at james valley)
		(at rubyring shop)
		(at knightshield shop)
		(at giovanna shop)
		(at candle mansion)
		(at humanskull cliff)
		(at dorian townarch)
		(at bouquet cliff)
		(at jordan mansion)
		(at avery mansion)
		(closed basemententrance)
		(closed bankentrance)
		(closed shopentrance)
		(closed fortentrance)
		(closed mansionentrance)
		(closed hutentrance)
		(closed forgeentrance)
		(closed barexit)
		(connected junkyard docks)
		(connected storage basement)
		(connected docks junkyard)
		(connected valley townsquare)
		(connected townsquare valley)
		(connected townsquare townarch)
		(connected docks townarch)
		(connected townsquare cliff)
		(connected townarch townsquare)
		(connected basement storage)
		(connected cliff townsquare)
		(connected townarch docks)
		(doorbetween towngate townarch townsquare)
		(doorbetween towngate townsquare townarch)
		(doorway docks junkyard)
		(doorway storage basement)
		(doorway basement storage)
		(doorway docks townarch)
		(doorway townarch docks)
		(doorway cliff townsquare)
		(doorway valley townsquare)
		(doorway townsquare cliff)
		(doorway junkyard docks)
		(doorway townsquare valley)
		(has dorian loveletter)
		(has mel basementbucket)
		(has alli ash)
		(has dorian lovecontract)
		(leadsto fortentrance fort)
		(leadsto fortexit valley)
		(leadsto forgeentrance forge)
		(leadsto forgeexit townarch)
		(leadsto hutentrance hut)
		(leadsto mansionentrance mansion)
		(leadsto shopexit townsquare)
		(leadsto mansionexit cliff)
		(leadsto shopentrance shop)
		(leadsto barexit docks)
		(leadsto bankentrance bank)
		(leadsto basemententrance basement)
		(leadsto bankexit townsquare)
		(leadsto basementexit bar)
		(leadsto hutexit townarch)
		(leadsto barentrance bar)
		(locked bankentrance)
		(player arthur)
		(prefab karina citizentwo)
		(prefab shop brickhouse)
		(prefab frank banker)
		(prefab avery majordomo)
		(prefab phillip baron)
		(prefab dave citizenone)
		(prefab townsquare town)
		(prefab peter blacksmith)
		(prefab matthias apprentice)
		(prefab lovecontract contract)
		(prefab coin coins)
		(prefab ash cat)
		(prefab tastycupcake cupcake)
		(prefab knightshield shield)
		(prefab rubyring ring)
		(prefab knightsword sword)
		(prefab oscar barkeep)
		(prefab roger governor)
		(prefab james riddler)
		(prefab jordan paladin)
		(prefab dorian knight)
		(prefab giovanna appraiser)
		(prefab alli orc)
		(prefab ian quartermaster)
		(prefab michael fortuneteller)
		(prefab mel wizard)
		(prefab arthur player)
		(prefab bouquet flowers)
		(prefab camille baroness)
		(prefab hairtonic tonic)
		(prefab rope lasso)
		(prefab loveletter letter)
		(prefab silver silverbullion)
		(prefab candle candlestick)
		(prefab bank brickhouse)
		(prefab humanskull skull)
		(prefab hutentrance woodendoor)
		(prefab forgeexit woodendoor)
		(prefab forgeentrance woodendoor)
		(prefab shinykey key)
		(prefab junkyard junk)
		(prefab docks beach)
		(prefab bar woodenhouse)
		(prefab storage brickhouse)
		(prefab basement brickhouse)
		(prefab basementexitkey key)
		(prefab townarch town)
		(prefab hut woodenhouse)
		(prefab mansionentrance woodendoor)
		(prefab barentrance woodendoor)
		(prefab mansion brickhouse)
		(prefab towngate gate)
		(prefab mansionexit woodendoor)
		(prefab basementexit woodendoor)
		(prefab mirror glassmirror)
		(prefab bankentrance woodendoor)
		(prefab valley cave)
		(prefab shopexit woodendoor)
		(prefab fortexit woodendoor)
		(prefab shopentrance woodendoor)
		(prefab fortentrance woodendoor)
		(prefab hutexit woodendoor)
		(prefab bankexit woodendoor)
		(prefab barexit woodendoor)
		(prefab bucket pailofwater)
		(prefab cliff cliffedge)
		(prefab fort brickhouse)
		(prefab book openbook)
		(prefab forge woodenhouse)
		(prefab basemententrance woodendoor)
		(prefab basementbucket pailofwater)
		(prefab mushroom tinymushroom)
		(unlocks shinykey bankentrance)
		(unlocks basementexitkey basementexit)
		(wants-item ian knightsword)
		(wants-item giovanna hairtonic)
		(wants-item arthur basementexitkey)
		(wants-item arthur lovecontract)
		(wants-item ian knightshield)
		(wants-item arthur ash)
		(wants-item arthur shinykey)
		(wants-item arthur loveletter)
		(wants-item alli tastycupcake)
		(wants-item james candle)
		(wants-item dorian rubyring)
		(wants-item dorian bouquet)
		(wants-item james humanskull)
		(wants-item james coin)
		(wants-item jordan loveletter)
		(wants-item jordan lovecontract)
		(willing-to-give-item arthur ash)
		(willing-to-give-item dorian loveletter)
		(willing-to-give-item dorian lovecontract)
		(willing-to-give-item arthur lovecontract)
		(willing-to-give-item arthur loveletter)
	)
	(:goal
	  (OR
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has alli tastycupcake)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has alli tastycupcake)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
		  )
		  (AND
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
		  )
		  (AND
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has james coin)
			(has james humanskull)
			(has james candle)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has alli tastycupcake)
		  )
		  (AND
			(has james coin)
			(has james humanskull)
			(has james candle)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
			(has alli tastycupcake)
		  )
		  (AND
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has ian knightsword)
			(has ian knightshield)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
			(has ian knightsword)
			(has ian knightshield)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has giovanna hairtonic)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
			(has giovanna hairtonic)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian bouquet)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		  (AND
			(has ian knightsword)
			(has ian knightshield)
			(has giovanna hairtonic)
			(has alli tastycupcake)
			(has jordan loveletter)
			(has dorian rubyring)
			(has jordan lovecontract)
			(has james coin)
			(has james humanskull)
			(has james candle)
		  )
		)
	)
)

; plan
1. (open arthur barexit bar)
   deleted: (closed barexit)
   goals met: 0 of 1
2. (move-through-entrance arthur bar barexit docks)
   deleted: (at arthur bar)
   added: (at arthur docks)
   goals met: 0 of 1
3. (move-through-doorway arthur docks townarch)
   deleted: (at arthur docks)
   added: (at arthur townarch)
   goals met: 0 of 1
4. (give dorian loveletter arthur townarch)
   deleted: (has dorian loveletter) (willing-to-give-item dorian loveletter) (wants-item arthur loveletter)
   added: (has arthur loveletter)
   goals met: 0 of 1
5. (open arthur hutentrance townarch)
   deleted: (closed hutentrance)
   goals met: 0 of 1
6. (move-through-entrance arthur townarch hutentrance hut)
   deleted: (at arthur townarch)
   added: (at arthur hut)
   goals met: 0 of 1
7. (pickup arthur book hut)
   deleted: (at book hut)
   added: (has arthur book) (willing-to-give-item arthur book)
   goals met: 0 of 1
8. (pickup arthur tastycupcake hut)
   deleted: (at tastycupcake hut)
   added: (has arthur tastycupcake) (willing-to-give-item arthur tastycupcake)
   goals met: 0 of 1
9. (pickup arthur hairtonic hut)
   deleted: (at hairtonic hut)
   added: (has arthur hairtonic) (willing-to-give-item arthur hairtonic)
   goals met: 0 of 1
10. (move-through-entrance arthur hut hutexit townarch)
   deleted: (at arthur hut)
   added: (at arthur townarch)
   goals met: 0 of 1
11. (give dorian lovecontract arthur townarch)
   deleted: (has dorian lovecontract) (willing-to-give-item dorian lovecontract) (wants-item arthur lovecontract)
   added: (has arthur lovecontract)
   goals met: 0 of 1
12. (move-through-door arthur townarch towngate townsquare)
   deleted: (at arthur townarch)
   added: (at arthur townsquare)
   goals met: 0 of 1
13. (move-through-doorway arthur townsquare cliff)
   deleted: (at arthur townsquare)
   added: (at arthur cliff)
   goals met: 0 of 1
14. (pickup arthur bouquet cliff)
   deleted: (at bouquet cliff)
   added: (has arthur bouquet) (willing-to-give-item arthur bouquet)
   goals met: 0 of 1
15. (open arthur mansionentrance cliff)
   deleted: (closed mansionentrance)
   goals met: 0 of 1
16. (move-through-entrance arthur cliff mansionentrance mansion)
   deleted: (at arthur cliff)
   added: (at arthur mansion)
   goals met: 0 of 1
17. (give arthur loveletter jordan mansion)
   deleted: (has arthur loveletter) (willing-to-give-item arthur loveletter) (wants-item jordan loveletter)
   added: (has jordan loveletter)
   goals met: 0 of 1
18. (give arthur lovecontract jordan mansion)
   deleted: (has arthur lovecontract) (willing-to-give-item arthur lovecontract) (wants-item jordan lovecontract)
   added: (has jordan lovecontract)
   goals met: 0 of 1
19. (move-through-entrance arthur mansion mansionexit cliff)
   deleted: (at arthur mansion)
   added: (at arthur cliff)
   goals met: 0 of 1
20. (move-through-doorway arthur cliff townsquare)
   deleted: (at arthur cliff)
   added: (at arthur townsquare)
   goals met: 0 of 1
21. (open arthur shopentrance townsquare)
   deleted: (closed shopentrance)
   goals met: 0 of 1
22. (move-through-door arthur townsquare towngate townarch)
   deleted: (at arthur townsquare)
   added: (at arthur townarch)
   goals met: 0 of 1
23. (give arthur bouquet dorian townarch)
   deleted: (has arthur bouquet) (willing-to-give-item arthur bouquet) (wants-item dorian bouquet)
   added: (has dorian bouquet)
   goals met: 0 of 1
24. (move-through-doorway arthur townarch docks)
   deleted: (at arthur townarch)
   added: (at arthur docks)
   goals met: 0 of 1
25. (move-through-doorway arthur docks junkyard)
   deleted: (at arthur docks)
   added: (at arthur junkyard)
   goals met: 0 of 1
26. (give arthur tastycupcake alli junkyard)
   deleted: (has arthur tastycupcake) (willing-to-give-item arthur tastycupcake) (wants-item alli tastycupcake)
   added: (has alli tastycupcake)
   goals met: 0 of 1
27. (move-through-doorway arthur junkyard docks)
   deleted: (at arthur junkyard)
   added: (at arthur docks)
   goals met: 0 of 1
28. (move-through-doorway arthur docks townarch)
   deleted: (at arthur docks)
   added: (at arthur townarch)
   goals met: 0 of 1
29. (move-through-door arthur townarch towngate townsquare)
   deleted: (at arthur townarch)
   added: (at arthur townsquare)
   goals met: 0 of 1
30. (move-through-entrance arthur townsquare shopentrance shop)
   deleted: (at arthur townsquare)
   added: (at arthur shop)
   goals met: 0 of 1
31. (give arthur hairtonic giovanna shop)
   deleted: (has arthur hairtonic) (willing-to-give-item arthur hairtonic) (wants-item giovanna hairtonic)
   added: (has giovanna hairtonic)
   goals met: 1 of 1
